
# tap repositories and their packages

tap 'homebrew/core'
brew 'adwaita-icon-theme'
brew 'amazon-ecs-cli'
brew 'ansible'
brew 'arp-scan'
brew 'atk'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bash-completion@2'
brew 'bash-git-prompt'
brew 'boost'
brew 'cairo'
brew 'carthage'
brew 'coreutils'
brew 'direnv'
brew 'elasticsearch'
brew 'envchain'
brew 'ffmpeg'
brew 'fontconfig'
brew 'freetype'
brew 'fribidi'
brew 'fzf'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'geckodriver'
brew 'gettext'
brew 'ghq'
brew 'git'
brew 'git-flow'
brew 'glib'
brew 'glide'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-units', args: ['with-default-names']
brew 'go'
brew 'gobject-introspection'
brew 'graphite2'
brew 'graphviz'
brew 'gsettings-desktop-schemas'
brew 'gtk+3'
brew 'gtksourceview3'
brew 'harfbuzz'
brew 'heroku'
brew 'hicolor-icon-theme'
brew 'htop'
brew 'httping'
brew 'httpstat'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'iperf'
brew 'jetty'
brew 'jpeg'
brew 'jpegoptim'
brew 'jq'
brew 'kubernetes-helm'
brew 'lame'
brew 'libcroco'
brew 'libepoxy'
brew 'libevent'
brew 'libffi'
brew 'libidn2'
brew 'libnet'
brew 'libpng'
brew 'libpq'
brew 'librsvg'
brew 'libsass'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libyaml'
brew 'lv'
brew 'makedepend'
brew 'mas'
brew 'mercurial'
brew 'meson-internal'
brew 'mitmproxy'
brew 'mongodb'
brew 'mycli'
brew 'mysql@5.7'
brew 'net-snmp'
brew 'nginx'
brew 'ninja'
brew 'nkf'
brew 'nmap'
brew 'node'
brew 'nodebrew'
brew 'oniguruma'
brew 'openssl'
brew 'openssl@1.1'
brew 'optipng'
brew 'packer'
brew 'pango'
brew 'pcre'
brew 'peco'
brew 'pgcli'
brew 'phantomjs'
brew 'pixman'
brew 'pkg-config'
brew 'postgresql'
brew 'protobuf'
brew 'pv'
brew 'py2cairo'
brew 'py3cairo'
brew 'pyenv'
brew 'pygobject3'
brew 'python'
brew 'python@2'
brew 'rancher-compose'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'ruby-build'
brew 'shared-mime-info'
brew 'source-highlight'
brew 'speedtest-cli'
brew 'sphinx-doc'
brew 'sqlite'
brew 'sshfs'
brew 'swagger-codegen'
brew 'teensy_loader_cli'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'yarn'

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'

tap 'homebrew/cask-versions'
cask 'docker-edge'
cask 'java8'

tap 'homebrew/fuse'

tap 'homebrew/gui'

tap 'homebrew/services'

tap 'homebrew/versions'

tap 'homebrew/cask'
cask 'alfred'
cask 'charles'
cask 'coteditor'
cask 'dbeaver-community'
cask 'flux'
cask 'geektool'
cask 'gimp'
cask 'google-drive-file-stream'
cask 'gyazo'
cask 'hyperswitch'
cask 'insomniax'
cask 'java'
cask 'marp'
cask 'mysqlworkbench'
cask 'ngrok'
cask 'owasp-zap'
cask 'postman'
cask 'rubymine'
cask 'shiba'
cask 'skype'
cask 'smcfancontrol'
cask 'thunderbird'
cask 'virtualbox'
cask 'vlc'
cask 'zeplin'

tap 'argon/mas'

tap 'buo/cask-upgrade'

tap 'heroku/brew'
brew 'heroku-node'

tap 'knqyf263/pet'
brew 'pet'

tap 'rcmdnk/file'
brew 'brew-file'

# Other Homebrew packages
brew 'chromedriver'

# Other Cask applications
cask 'boostnote'
cask 'clipy'
cask 'cyberduck'
cask 'firefox'
cask 'franz'
cask 'genymotion'
cask 'gitify'
cask 'google-japanese-ime'
cask 'google-play-music-desktop-player'
cask 'hammerspoon'
cask 'insomnia'
cask 'iterm2'
cask 'macdown'
cask 'meld'
cask 'mongo-management-studio'
cask 'nanowallet'
cask 'osxfuse'
cask 'pocket-casts'
cask 'rdm'
cask 'sequel-pro'
cask 'sketch'
cask 'slack'
cask 'teensy'
cask 'tripmode'
cask 'visual-studio-code'
cask 'xquartz'

# App Store applications
mas '1Password (6.8.8)', id: 443987910
mas 'AnyDo (3.2.1)', id: 944960179
mas 'Divergence-Clock (1.0.2)', id: 945818720
mas 'Gapplin (1.3.1)', id: 768053424
mas 'Go for Twitter (1.4.1)', id: 991672828
mas 'JustFocus (1.6.1)', id: 1142151959
mas 'Keynote (8.1)', id: 409183694
mas 'LINE (5.8.0)', id: 539883307
mas 'Magnet (2.1.0)', id: 441258766
mas 'Slack (3.2.0)', id: 803453959
mas 'Table Tool (1.2.1)', id: 1122008420
