
# tap repositories and their packages

tap 'homebrew/core'
brew 'adwaita-icon-theme'
brew 'ansible'
brew 'atk'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'bash-git-prompt'
brew 'boost'
brew 'cairo'
brew 'carthage'
brew 'coreutils'
brew 'direnv'
brew 'docker'
brew 'elasticsearch'
brew 'ffmpeg'
brew 'fontconfig'
brew 'freetype'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'ghq'
brew 'git'
brew 'git-flow'
brew 'glib'
brew 'glide'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-units', args: ['with-default-names']
brew 'go'
brew 'gobject-introspection'
brew 'graphite2'
brew 'gsettings-desktop-schemas'
brew 'gtk+3'
brew 'gtksourceview3'
brew 'harfbuzz'
brew 'heroku'
brew 'hicolor-icon-theme'
brew 'htop'
brew 'httping'
brew 'httpstat'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'iperf'
brew 'jetty'
brew 'jpeg'
brew 'jpegoptim'
brew 'jq'
brew 'lame'
brew 'libcroco'
brew 'libepoxy'
brew 'libevent'
brew 'libffi'
brew 'libpng'
brew 'librsvg'
brew 'libsass'
brew 'libtiff'
brew 'libtool'
brew 'libyaml'
brew 'lv'
brew 'mas'
brew 'mercurial'
brew 'mycli'
brew 'mysql'
brew 'net-snmp'
brew 'nginx'
brew 'nkf'
brew 'nmap'
brew 'node'
brew 'nodebrew'
brew 'oniguruma'
brew 'openssl'
brew 'openssl@1.1'
brew 'optipng'
brew 'packer'
brew 'pango'
brew 'pcre'
brew 'peco'
brew 'phantomjs'
brew 'pixman'
brew 'pkg-config'
brew 'postgresql'
brew 'py2cairo'
brew 'pyenv'
brew 'pygobject3'
brew 'python'
brew 'python3'
brew 'rancher-compose'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'ruby-build'
brew 'shared-mime-info'
brew 'source-highlight'
brew 'sqlite'
brew 'sshfs'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'yarn'

tap 'homebrew/bundle'

tap 'homebrew/fuse'

tap 'homebrew/gui'

tap 'homebrew/services'

tap 'homebrew/versions'

tap 'caskroom/cask'
cask 'alfred'
cask 'amazon-music'
cask 'clipy'
cask 'coteditor'
cask 'cyberduck'
cask 'flux'
cask 'franz'
cask 'geektool'
cask 'genymotion'
cask 'gimp'
cask 'google-drive-file-stream'
cask 'google-japanese-ime'
cask 'google-play-music-desktop-player'
cask 'gyazo'
cask 'hammerspoon'
cask 'hyperswitch'
cask 'insomnia'
cask 'insomniax'
cask 'iterm2'
cask 'jasper'
cask 'java'
cask 'macdown'
cask 'marp'
cask 'meld'
cask 'mysqlworkbench'
cask 'osxfuse'
cask 'owasp-zap'
cask 'postman'
cask 'rdm'
cask 'rubymine'
cask 'sequel-pro'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'thunderbird'
cask 'tripmode'
cask 'virtualbox'

tap 'caskroom/fonts'
cask 'font-fira-code'

tap 'caskroom/versions'

tap 'argon/mas'

tap 'heroku/brew'
brew 'heroku-node'

tap 'knqyf263/pet'
brew 'pet'

tap 'rcmdnk/file'
brew 'brew-file'

# Cask applications
cask 'pocketcasts'

# App Store applications
#appstore '409183694 Keynote (7.3)'
#appstore '539883307 LINE (5.3.3)'
#appstore '441258766 Magnet (2.1.0)'
#appstore '803453959 Slack (2.8.2)'
#appstore '1122008420 Table Tool (1.2.1)'
#appstore '497799835 Xcode (9.1)'
